import numpy as np
#1. Что надо изменить в последнем примере, чтобы он заработал без ошибок (транслирование)?
# X = np.array([[1, 2, 3, 4, 5, 6, 7, 8, 9],
#              [9, 8, 7, 6, 5, 4, 3, 2, 1]]) (2,9)

# Xmean0 = X.mean(0) (9,) -> (1,9) -> (2,9)
# Xcenter0 = X - Xmean0
# Xmean1 = X.mean(1) (2,) -> (1,2) -> (2,2) != (2,9)
# Xcenter1 = X - Xmean1
X = np.array([[1, 2, 3, 4, 5, 6, 7, 8, 9],
             [9, 8, 7, 6, 5, 4, 3, 2, 1]])

Xmean0 = X.mean(0)
Xcenter0 = X - Xmean0
Xmean1 = X.mean(1)

Xmean1 = Xmean1[:, np.newaxis] #(2,) -> (2,1) добавляем справа ось

Xcenter1 = X - Xmean1 #(2,1) -> (2,9) Ошибка исправлена
print(Xcenter1)

#2. Пример для y. Вычислить количество элементов (по обоим размерностям), значения которых больше 3 и меньше 9
y = np.array([[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]])

print(np.sum((y > 3) & (y < 9), axis=0))
print(np.sum((y > 3) & (y < 9), axis=1))